MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_hash.h
  * @brief   Header file of HASH HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_HASH_H
#define STM32C5XX_HAL_HASH_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined (HASH)

/** @defgroup HASH HASH
  * @brief HASH HAL module driver.
  * @{
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup HASH_Exported_Constants HAL HASH Constants
  * @{
  */

/** @defgroup HASH_Error_Definition HASH Error Definition
  * @{
  */
#define HAL_HASH_ERROR_NONE  (0x00000000U) /*!< No error                */
#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1U)
#define HAL_HASH_ERROR_DMA   (0x00000002U) /*!< DMA-based process error */
#endif /* USE_HAL_HASH_DMA */
/**
  * @}
  */

/** @defgroup HASH_flags_definition HASH flags definitions
  * @{
  */
#define HAL_HASH_FLAG_DINI   HASH_SR_DINIS /*!< Input buffer is ready for new data                         */
#define HAL_HASH_FLAG_DCI    HASH_SR_DCIS  /*!< Digest calculation is completed                            */
#define HAL_HASH_FLAG_DMA    HASH_SR_DMAS  /*!< DMA interface is enabled or a transfer is ongoing          */
#define HAL_HASH_FLAG_BUSY   HASH_SR_BUSY  /*!< Hash core is busy, processing a block of data              */
#define HAL_HASH_FLAG_DINNE  HASH_SR_DINNE /*!< Data input register is not empty                           */
/**
  * @}
  */

/** @defgroup HASH_interrupts_definition HASH interrupts definitions
  * @{
  */
#define HAL_HASH_IT_DIN      HASH_IMR_DINIE /*!< Input buffer ready interrupt                              */
#define HAL_HASH_IT_DC       HASH_IMR_DCIE  /*!< Digest calculation complete interrupt                     */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros ---------------------------------------------------------------------------------------------------*/
/** @defgroup HASH_Exported_Macros HASH Core Macros
  * @{
This subsection provides a macro that allows you to check the current handle state and move it to a new state
in an atomic way.
  */
/*! Check the current handle state and move it to a new state in an atomic way */
#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 1U)
#define HASH_CHECK_UPDATE_STATE(handle, state_field, hash_conditional_state, hash_new_state)                        \
  do {                                                                                                              \
    do {                                                                                                            \
      /* Return HAL_BUSY if the status is not ready */                                                              \
      if ((__LDREXW((volatile uint32_t *)((uint32_t)&(handle)->state_field))                                        \
           & (uint32_t)(hash_conditional_state)) == 0U)                                                             \
      {                                                                                                             \
        return HAL_BUSY;                                                                                            \
      }                                                                                                             \
      /* If state is ready then attempt to change the state to the new one */                                       \
    } while (__STREXW((uint32_t)(hash_new_state), (volatile uint32_t *)((uint32_t)&((handle)->state_field))) != 0U);\
    /* Do not start any other memory access until memory barrier is complete */                                     \
    __DMB();                                                                                                        \
  } while (0)
#else
#define HASH_CHECK_UPDATE_STATE(handle, state_field, hash_conditional_state, hash_new_state)                        \
  do {                                                                                                              \
    (handle)->state_field = (hash_new_state);                                                                       \
  } while(0)
#endif /* USE_HAL_CHECK_PROCESS_STATE == 1U */
/**
  * @}
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup HASH_Exported_Types HAL HASH Types
  * @{
  */
/*! HASH instance */
typedef enum
{
  HAL_HASH = HASH_BASE, /*!< HAL HASH instance */
} hal_hash_t;

/*! HAL Global State enumeration definition */
typedef enum
{
  HAL_HASH_STATE_RESET               = 0U,           /*!< HASH is not initialized                           */
  HAL_HASH_STATE_INIT                = (1UL << 31U), /*!< HASH is initialized but not yet configured        */
  HAL_HASH_STATE_CONFIGURED          = (1UL << 30U), /*!< HASH initialized and a global config applied      */
  HAL_HASH_HMAC_STATE_CONFIGURED     = (1UL << 29U), /*!< HASH HMAC initialized and a global config applied */
  HAL_HASH_STATE_COMPUTE_ACTIVE      = (1UL << 28U), /*!< HASH compute active process is ongoing            */
  HAL_HASH_STATE_UPDATE_ACTIVE       = (1UL << 27U), /*!< HASH update active process is ongoing             */
  HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE = (1UL << 26U), /*!< HASH HMAC compute active process is ongoing       */
  HAL_HASH_HMAC_STATE_UPDATE_ACTIVE  = (1UL << 25U), /*!< HASH HMAC update active process is ongoing        */
  HAL_HASH_STATE_SUSPENDED           = (1UL << 24U), /*!< HASH is suspended                                 */
  HAL_HASH_STATE_ABORT               = (1UL << 23U)  /*!< HASH is aborted                                   */
} hal_hash_state_t;

/*! HASH algorithm selection */
typedef enum
{
  HAL_HASH_ALGO_SHA1      = 0U,                                         /*!< HASH algorithm is SHA1      */
  HAL_HASH_ALGO_SHA224    = HASH_CR_ALGO_1,                             /*!< HASH algorithm is SHA224    */
  HAL_HASH_ALGO_SHA256    = (HASH_CR_ALGO_1 | HASH_CR_ALGO_0),          /*!< HASH algorithm is SHA256    */
#if defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
  HAL_HASH_ALGO_SHA384    = (HASH_CR_ALGO_3 | HASH_CR_ALGO_2),          /*!< HASH algorithm is SHA384    */
#endif /* HASH_CR_ALGO_3 | HASH_CR_ALGO_2 */
#if ( defined(HASH_CR_ALGO_0) && defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3))
  HAL_HASH_ALGO_SHA512224 = (HASH_CR_ALGO_3 | HASH_CR_ALGO_2 | HASH_CR_ALGO_0), /*!< HASH algorithm is SHA512224 */
#endif /* HASH_CR_ALGO_3 | HASH_CR_ALGO_2 | HASH_CR_ALGO_0 */
#if ( defined(HASH_CR_ALGO_1) && defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3))
  HAL_HASH_ALGO_SHA512256 = (HASH_CR_ALGO_3 | HASH_CR_ALGO_2 | HASH_CR_ALGO_1), /*!< HASH algorithm is SHA512256 */
#endif /* HASH_CR_ALGO_3 | HASH_CR_ALGO_2 | HASH_CR_ALGO_1 */
#if ( defined(HASH_CR_ALGO_0) && defined(HASH_CR_ALGO_1) && defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3))
  HAL_HASH_ALGO_SHA512    = (HASH_CR_ALGO_3 | HASH_CR_ALGO_2 | HASH_CR_ALGO_1 | HASH_CR_ALGO_0), /*!< HASH algorithm is SHA512    */
#endif /* HASH_CR_ALGO_3 |HASH_CR_ALGO_2 | HASH_CR_ALGO_1 | HASH_CR_ALGO_0 */
} hal_hash_algo_t;

/*! HASH data swapping enumeration definition */
typedef enum
{
  HAL_HASH_DATA_SWAP_NO       = 0U,                 /*!< 32-bit data. No swapping                     */
  HAL_HASH_DATA_SWAP_HALFWORD = HASH_CR_DATATYPE_0, /*!< 16-bit data. Each half word is swapped       */
  HAL_HASH_DATA_SWAP_BYTE     = HASH_CR_DATATYPE_1, /*!< 8-bit data. All bytes are swapped            */
  HAL_HASH_DATA_SWAP_BIT      = HASH_CR_DATATYPE    /*!< 1-bit data. In the word all bits are swapped */
} hal_hash_data_swapping_t;

/*! HASH Configuration structure definition */
typedef struct
{
  hal_hash_data_swapping_t data_swapping; /*!< Data swapping mode: No swap (32-bit data), half word swap (16-bit data),
                                               byte swap (8-bit data) or bit swap (1-bit data).
                                               This parameter can be a value of @ref hal_hash_data_swapping_t. */
  hal_hash_algo_t          algorithm;     /*!< HASH algorithm SHA-1, SHA2-224, SHA2-256, and on some supported
                    devices SHA2-384, SHA2-512224, SHA2-512256 and SHA2-512.
                                               This parameter can be a value of @ref hal_hash_algo_t           */
} hal_hash_config_t;

/*! HASH HMAC Configuration structure definition */
typedef struct
{
  hal_hash_data_swapping_t data_swapping;  /*!< No swap (32-bit data), half word swap (16-bit data), byte swap
                                                (8-bit data) or bit swap (1-bit data).
                                                This parameter can be a value of @ref hal_hash_data_swapping_t. */

  hal_hash_algo_t          algorithm;      /*!< HASH algorithm SHA-1, SHA2-224, SHA2-256, and on some supported
                    devices SHA2-384, SHA2-512224, SHA2-512256 and SHA2-512.
                                               This parameter can be a value of @ref hal_hash_algo_t            */

  uint8_t                  *p_hmac_key;    /*!< Pointer to the HMAC key data (read-only)                        */

  uint32_t                 key_size_byte;  /*!< The HMAC key size in bytes                                      */
} hal_hash_hmac_config_t;

typedef struct hal_hash_handle_s hal_hash_handle_t; /*!< HASH handle structure type */

#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
typedef void (*hal_hash_cb_t)(hal_hash_handle_t *hhash); /*!< HAL HASH callback pointer definition */
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */

/*! HASH suspend/resume context structure */
typedef struct
{
  uint32_t csr_reg[HASH_CSR_REGISTERS_NUMBER];      /*!< Copy of HASH context swap register when processing is
                                                         suspended                                                 */
  uint32_t imr_reg;                                 /*!< Copy of HASH interrupt enable register when processing is
                                                         suspended                                                 */
  uint32_t str_reg;                                 /*!< Copy of HASH start register when processing is suspended  */

  uint32_t cr_reg;                                  /*!< Copy of HASH control register when processing is
                                                         suspended                                                 */

  uint32_t input_data_count_byte;                   /*!< Copy of input data counter                                */

  uint32_t input_size_byte;                         /*!< Copy of buffer input size to be processed in bytes        */

