MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.h
  uint32_t output_size_byte;                        /*!< Copy of buffer output size to be processed in bytes       */

  uint32_t digest_size_byte;                        /*!< Copy of digest size in bytes of selected algorithm        */

  uint32_t key_size_byte;                           /*!< Copy of HASH key size in bytes                            */

  uint32_t phase;                                   /*!< Copy of HASH peripheral phase                             */

#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1U)
  hal_dma_handle_t *hdma_in;                        /*!< Copy of HASH input DMA handle parameters                  */
#endif /* USE_HAL_HASH_DMA */

#if defined (USE_HAL_HASH_REGISTER_CALLBACKS ) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hal_hash_cb_t p_digest_cplt_callback;             /*!< Copy of HASH digest computation completion callback        */
  hal_hash_cb_t p_input_cplt_callback;              /*!< Copy of HASH input FIFO transfer completed callback        */
  hal_hash_cb_t p_error_callback;                   /*!< Copy of HASH error callback                                */
  hal_hash_cb_t p_abort_cplt_callback;              /*!< Copy of HASH abort callback                                */
  hal_hash_cb_t p_suspend_cplt_callback;            /*!< Copy of HASH suspend callback                              */
#endif /* (USE_HAL_HASH_REGISTER_CALLBACKS) */

  const uint8_t *p_input_buff;                      /*!< Copy of pointer to input buffer                            */

  uint8_t *p_output_buff;                           /*!< Copy of pointer to output buffer (digest)                  */

  uint8_t *p_hmac_key_buff;                         /*!< Copy of pointer to key buffer (HMAC only)                  */

  uint8_t *p_hmac_key_saved;                        /*!< Copy of pointer to key buffer (HMAC only)                  */

#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1U)
  uint8_t  dma_operation_active_flag;               /*!< Copy of DMA flag operation ongoing                         */
#endif /* USE_HAL_HASH_DMA */

  hal_hash_state_t previous_state;                  /*!< Copy of HASH peripheral state                              */

} hal_hash_suspended_context_t;

/*! HASH handle structure definition */
struct hal_hash_handle_s
{
  hal_hash_t                  instance;                 /*!< HASH register base address                     */

  uint32_t                    input_size_byte;          /*!< Buffer input size to be processed in bytes     */

  uint32_t                    output_size_byte;         /*!< Buffer output size to be processed in bytes    */

  uint32_t                    *p_output_hash_size_byte; /*!< Buffer output size processed in bytes          */

  uint32_t                    input_data_count_byte;    /*!< Input data counter                             */

  uint32_t                    digest_size_byte;         /*!< HASH digest size in bytes of selected algorithm */

  uint32_t                    block_size_byte;          /*!< HASH block size in bytes of selected algorithm */

  uint32_t                    key_size_byte;            /*!< HASH key size in bytes                         */

  volatile uint32_t           suspend_request;          /*!< HASH peripheral suspension request flag        */

  uint32_t                    phase;                    /*!< HASH peripheral phase                          */

#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
  volatile  uint32_t          last_error_codes;         /*!< HASH last error codes                          */
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */

  const uint8_t               *p_input_buff;            /*!< Pointer to input buffer                     */

  uint8_t                     *p_output_buff;           /*!< Pointer to output buffer (digest)           */

  uint8_t                     *p_hmac_key_buff;         /*!< Pointer to key buffer (HMAC only)           */

  uint8_t                     *p_hmac_key_saved;        /*!< Pointer to store the key buffer (HMAC only) */

  uint8_t                     remain_bytes[3];          /*!< HASH remaining bytes                        */

  uint8_t                     remain_bytes_number;      /*!< Number of remaining HASH bytes              */

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  uint8_t                     dma_operation_active_flag; /*!< DMA flag operation ongoing                  */
#endif /* USE_HAL_HASH_DMA */

  volatile hal_hash_state_t   global_state;              /*!< HASH peripheral state                       */
  volatile hal_hash_state_t   previous_state;            /*!< HASH peripheral previous state              */

#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1U)
  hal_dma_handle_t           *hdma_in;                   /*!< HASH input DMA handle parameters            */
#endif /* USE_HAL_HASH_DMA */

#if defined (USE_HAL_HASH_USER_DATA) && (USE_HAL_HASH_USER_DATA == 1)
  const void                  *p_user_data;              /*!< HASH user data                              */
#endif /* USE_HAL_HASH_USER_DATA */

#if defined (USE_HAL_HASH_REGISTER_CALLBACKS ) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hal_hash_cb_t               p_input_cplt_callback;   /*!< HASH input completion callback              */
  hal_hash_cb_t               p_digest_cplt_callback;  /*!< HASH digest computation completion callback */
  hal_hash_cb_t               p_error_callback;        /*!< HASH error callback                         */
  hal_hash_cb_t               p_suspend_cplt_callback; /*!< HASH suspend callback                       */
  hal_hash_cb_t               p_abort_cplt_callback;   /*!< HASH abort callback                         */
#endif /* (USE_HAL_HASH_REGISTER_CALLBACKS) */
};
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup HASH_Exported_Functions HAL HASH Functions
  * @{
  */

/** @defgroup HASH_Exported_Functions_Group1 HASH initialization and de-initialization functions
  * @{
  */
hal_status_t HAL_HASH_Init(hal_hash_handle_t *hhash, hal_hash_t instance);
void HAL_HASH_DeInit(hal_hash_handle_t *hhash);
/**
  * @}
  */

/** @defgroup HASH_Exported_Functions_Group2 HASH set and get configuration functions
  * @{
  */
hal_status_t HAL_HASH_SetConfig(hal_hash_handle_t *hhash, const hal_hash_config_t *p_config);
void HAL_HASH_GetConfig(const hal_hash_handle_t *hhash, hal_hash_config_t *p_config);
/**
  * @}
  */

