MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.h
/** @defgroup HASH_Exported_Functions_Group3 HASH processing functions
  * @{
  */
hal_status_t HAL_HASH_Compute(hal_hash_handle_t *hhash, const void *p_input_buffer, uint32_t input_size_byte,
                              void *p_output_buffer, uint32_t output_buffer_size_byte,
                              uint32_t *p_output_hash_size_byte, uint32_t timeout_ms);
hal_status_t HAL_HASH_Compute_IT(hal_hash_handle_t *hhash, const void *p_input_buffer,
                                 uint32_t input_size_byte, void *p_output_buffer,
                                 uint32_t output_buffer_size_byte, uint32_t *p_output_hash_size_byte);
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
hal_status_t HAL_HASH_Compute_DMA(hal_hash_handle_t *hhash, const void *p_input_buffer, uint32_t input_size_byte,
                                  void *p_output_buffer, uint32_t output_buffer_size_byte,
                                  uint32_t *p_output_hash_size_byte);
#endif /* USE_HAL_HASH_DMA */

hal_status_t HAL_HASH_Update(hal_hash_handle_t *hhash, const void *p_add_input_buffer, uint32_t input_size_byte,
                             uint32_t timeout_ms);

hal_status_t HAL_HASH_Update_IT(hal_hash_handle_t *hhash, const void *p_add_input_buffer, uint32_t input_size_byte);

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
hal_status_t HAL_HASH_Update_DMA(hal_hash_handle_t *hhash, const void *p_add_input_buffer,
                                 uint32_t input_size_byte);
#endif /* USE_HAL_HASH_DMA */

hal_status_t HAL_HASH_Finish(hal_hash_handle_t *hhash, void *p_output_buffer, uint32_t output_buffer_size_byte,
                             uint32_t *p_output_hash_size_byte, uint32_t timeout_ms);
/**
  * @}
  */

/** @defgroup HASH_Exported_Functions_Group4 HASH HMAC Set and Get configurations functions
  * @{
  */
hal_status_t HAL_HASH_HMAC_SetConfig(hal_hash_handle_t *hhash, const hal_hash_hmac_config_t *p_config);
void HAL_HASH_HMAC_GetConfig(const hal_hash_handle_t *hhash, hal_hash_hmac_config_t *p_config);
/**
  * @}
  */

/** @defgroup HASH_Exported_Functions_Group5 HMAC processing functions
  * @{
  */
hal_status_t HAL_HASH_HMAC_Compute(hal_hash_handle_t *hhash, const void *p_input_buffer, uint32_t input_size_byte,
                                   void *p_output_buffer, uint32_t output_buffer_size_byte,
                                   uint32_t *p_output_hash_size_byte, uint32_t timeout_ms);
hal_status_t HAL_HASH_HMAC_Compute_IT(hal_hash_handle_t *hhash, const void *p_input_buffer, uint32_t input_size_byte,
                                      void *p_output_buffer, uint32_t output_buffer_size_byte,
                                      uint32_t *p_output_hash_size_byte);
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
hal_status_t HAL_HASH_HMAC_Compute_DMA(hal_hash_handle_t *hhash, const void *p_input_buffer,
                                       uint32_t input_size_byte, void *p_output_buffer,
                                       uint32_t output_buffer_size_byte, uint32_t *p_output_hash_size_byte);
#endif /* USE_HAL_HASH_DMA */

hal_status_t HAL_HASH_HMAC_Update(hal_hash_handle_t *hhash, const void *p_add_input_buffer, uint32_t input_size_byte,
                                  uint32_t timeout_ms);

hal_status_t HAL_HASH_HMAC_Update_IT(hal_hash_handle_t *hhash, const void *p_add_input_buffer,
                                     uint32_t input_size_byte);

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
hal_status_t HAL_HASH_HMAC_Update_DMA(hal_hash_handle_t *hhash, const void *p_add_input_buffer,
                                      uint32_t input_size_byte);
#endif /* USE_HAL_HASH_DMA */

hal_status_t HAL_HASH_HMAC_Finish(hal_hash_handle_t *hhash, void *p_output_buffer, uint32_t output_buffer_size_byte,
                                  uint32_t *p_output_hash_size_byte, uint32_t timeout_ms);
/**
  * @}
  */

/** @defgroup HASH_Exported_Functions_Group6 HASH Abort functions
  * @{
  */
hal_status_t HAL_HASH_Abort(hal_hash_handle_t *hhash, uint32_t timeout_ms);
hal_status_t HAL_HASH_Abort_IT(hal_hash_handle_t *hhash);
/**
  * @}
  */

/** @defgroup HASH_Exported_Functions_Group7 HASH IRQ handler, callbacks, and link DMA functions
  * @{
  */
void HAL_HASH_IRQHandler(hal_hash_handle_t *hhash);
void HAL_HASH_InputCpltCallback(hal_hash_handle_t *hhash);
void HAL_HASH_DigestCpltCallback(hal_hash_handle_t *hhash);
void HAL_HASH_ErrorCallback(hal_hash_handle_t *hhash);
void HAL_HASH_SuspendCallback(hal_hash_handle_t *hhash);
void HAL_HASH_AbortCallback(hal_hash_handle_t *hhash);

#if defined (USE_HAL_HASH_REGISTER_CALLBACKS ) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
hal_status_t HAL_HASH_RegisterInputCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback);
hal_status_t HAL_HASH_RegisterDigestComputationCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback);
hal_status_t HAL_HASH_RegisterErrorCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback);
hal_status_t HAL_HASH_RegisterSuspendCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback);
hal_status_t HAL_HASH_RegisterAbortCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
hal_status_t HAL_HASH_SetInDMA(hal_hash_handle_t *hhash, hal_dma_handle_t *hdma_in);
#endif /* USE_HAL_HASH_DMA */
/**
  * @}
  */

/** @defgroup HASH_Exported_Functions_Group8 HASH suspend/resume functions
  * @{
  */
hal_status_t HAL_HASH_RequestSuspendComputation(hal_hash_handle_t *hhash);
hal_status_t HAL_HASH_ResumeComputation(hal_hash_handle_t *hhash);
hal_status_t HAL_HASH_RequestSuspendUpdate(hal_hash_handle_t *hhash);
hal_status_t HAL_HASH_ResumeUpdate(hal_hash_handle_t *hhash);
void HAL_HASH_SaveContext(hal_hash_handle_t *hhash, hal_hash_suspended_context_t *p_context);
void HAL_HASH_RestoreContext(hal_hash_handle_t *hhash, const hal_hash_suspended_context_t *p_context);
/**
  * @}
  */

/** @defgroup HASH_Exported_Functions_Group9 HASH peripheral state, error, and user data functions
  * @{
  */
hal_hash_state_t HAL_HASH_GetState(const hal_hash_handle_t *hhash);

#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
uint32_t HAL_HASH_GetLastErrorCodes(const hal_hash_handle_t *hhash);
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */

#if defined (USE_HAL_HASH_USER_DATA) && (USE_HAL_HASH_USER_DATA == 1)
void HAL_HASH_SetUserData(hal_hash_handle_t *hhash, const void *p_user_data);
const void *HAL_HASH_GetUserData(const hal_hash_handle_t *hhash);
#endif /* USE_HAL_HASH_USER_DATA */
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group10 HASH static inline functions
  * @{
This section provides functions that allow you to manage HASH interrupts and flags:
- Call the function HAL_HASH_IsActiveFlag() to check whether the specified HASH flag is set or not.
- Call the function HAL_HASH_GetITSource() to check whether the specified HASH interrupt source is enabled or not.
- Call the function HAL_HASH_EnableIT() to enable the HASH device interrupt.
- Call the function HAL_HASH_DisableIT() to disable the device interrupt.
- Call the function HAL_HASH_ClearFlag() to clear the specified HASH flag.
  */
/** @brief Check whether the specified HASH flag is set.
  * @param hhash Specifies the HASH handle.
  * @param flag  Specifies the flag to check.
  *        This parameter must be a combination of @ref HASH_flags_definition.
  * @retval uint32_t The state of flag (0 or 1).
  */
__STATIC_INLINE uint32_t HAL_HASH_IsActiveFlag(const hal_hash_handle_t *hhash, uint32_t flag)
{
  return (uint32_t)(((((HASH_TypeDef *)((uint32_t)(hhash->instance)))->SR & (flag)) == (flag)) ? 1U : 0U);
}

