MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.h
/** @brief Check whether the specified HASH interrupt source is enabled.
  * @param hhash     Specifies the HASH handle.
  * @param interrupt Source to check.
  *         This parameter must be a combination of @ref HASH_interrupts_definition.
  * @retval uint32_t State of the interrupt (0 or 1).
  */
__STATIC_INLINE uint32_t HAL_HASH_GetITSource(const hal_hash_handle_t *hhash, uint32_t interrupt)
{
  return ((STM32_READ_BIT(((HASH_TypeDef *)((uint32_t)hhash->instance))->IMR, (uint32_t)interrupt)
           == (uint32_t)interrupt) ? 1U : 0U);
}

/** @brief Enable the specified HASH interrupt.
  * @param hhash     Specifies the HASH handle.
  * @param interrupt Specifies the HASH interrupt source to enable.
  *         This parameter must be a combination of @ref HASH_interrupts_definition.
  */
__STATIC_INLINE void HAL_HASH_EnableIT(hal_hash_handle_t *hhash, uint32_t interrupt)
{
  STM32_SET_BIT(((HASH_TypeDef *)((uint32_t)(hhash->instance)))->IMR, interrupt);
}

/** @brief Disable the specified HASH interrupt.
  * @param hhash     Specifies the HASH handle.
  * @param interrupt Specifies the HASH interrupt source to disable.
  *         This parameter must be a combination of @ref HASH_interrupts_definition.
  */
__STATIC_INLINE void HAL_HASH_DisableIT(hal_hash_handle_t *hhash, uint32_t interrupt)
{
  STM32_CLEAR_BIT(((HASH_TypeDef *)((uint32_t)(hhash->instance)))->IMR, interrupt);
}

/** @brief Clear the specified HASH flag.
  * @param hhash Specifies the HASH handle.
  * @param flag  Specifies the flag to clear.
  *        This parameter must be a combination of @ref HASH_flags_definition.
  */
__STATIC_INLINE void HAL_HASH_ClearFlag(hal_hash_handle_t *hhash, uint32_t flag)
{
  STM32_CLEAR_BIT(((HASH_TypeDef *)((uint32_t)(hhash->instance)))->SR, (flag));
}

/**
  * @}
 */

/**
  * @}
  */

/**
  * @}
  */

#endif /* HASH */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_HASH_H */
